app/controllers/sessions_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."email" = ? LIMIT ?  [["email", "phabibi@sfu.ca"], ["LIMIT", 1]]
---
  def create
    @player = Player.find_by(email: params[:session][:email])